backend/loadtest/results/02_vote_surge.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/jeremycointre/music-room/backend/loadtest/02_vote_surge.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m50s max duration (incl. graceful stop):
              * voters: Up to 50 looping VUs for 1m40s over 3 stages (gracefulRampDown: 10s, gracefulStop: 30s)


running (0m01.0s), 06/50 VUs, 5 complete and 0 interrupted iterations
voters   [   1% ] 06/50 VUs  0m01.0s/1m40.0s

running (0m02.0s), 07/50 VUs, 11 complete and 0 interrupted iterations
voters   [   2% ] 07/50 VUs  0m02.0s/1m40.0s

running (0m03.0s), 09/50 VUs, 21 complete and 0 interrupted iterations
voters   [   3% ] 09/50 VUs  0m03.0s/1m40.0s

running (0m04.0s), 10/50 VUs, 30 complete and 0 interrupted iterations
voters   [   4% ] 10/50 VUs  0m04.0s/1m40.0s

running (0m05.0s), 12/50 VUs, 49 complete and 0 interrupted iterations
voters   [   5% ] 12/50 VUs  0m05.0s/1m40.0s

running (0m06.0s), 13/50 VUs, 63 complete and 0 interrupted iterations
voters   [   6% ] 13/50 VUs  0m06.0s/1m40.0s

running (0m07.0s), 15/50 VUs, 78 complete and 0 interrupted iterations
voters   [   7% ] 15/50 VUs  0m07.0s/1m40.0s

running (0m08.0s), 16/50 VUs, 96 complete and 0 interrupted iterations
voters   [   8% ] 16/50 VUs  0m08.0s/1m40.0s

running (0m09.0s), 18/50 VUs, 120 complete and 0 interrupted iterations
voters   [   9% ] 18/50 VUs  0m09.0s/1m40.0s

running (0m10.0s), 19/50 VUs, 139 complete and 0 interrupted iterations
voters   [  10% ] 19/50 VUs  0m10.0s/1m40.0s

running (0m11.0s), 21/50 VUs, 161 complete and 0 interrupted iterations
voters   [  11% ] 21/50 VUs  0m11.0s/1m40.0s

running (0m12.0s), 22/50 VUs, 183 complete and 0 interrupted iterations
voters   [  12% ] 22/50 VUs  0m12.0s/1m40.0s

running (0m13.0s), 24/50 VUs, 203 complete and 0 interrupted iterations
voters   [  13% ] 24/50 VUs  0m13.0s/1m40.0s

running (0m14.0s), 25/50 VUs, 224 complete and 0 interrupted iterations
voters   [  14% ] 25/50 VUs  0m14.0s/1m40.0s

running (0m15.0s), 27/50 VUs, 245 complete and 0 interrupted iterations
voters   [  15% ] 27/50 VUs  0m15.0s/1m40.0s

running (0m16.0s), 28/50 VUs, 261 complete and 0 interrupted iterations
voters   [  16% ] 28/50 VUs  0m16.0s/1m40.0s

running (0m17.0s), 30/50 VUs, 285 complete and 0 interrupted iterations
voters   [  17% ] 30/50 VUs  0m17.0s/1m40.0s

running (0m18.0s), 31/50 VUs, 311 complete and 0 interrupted iterations
voters   [  18% ] 31/50 VUs  0m18.0s/1m40.0s

running (0m19.0s), 33/50 VUs, 330 complete and 0 interrupted iterations
voters   [  19% ] 33/50 VUs  0m19.0s/1m40.0s

running (0m20.0s), 34/50 VUs, 356 complete and 0 interrupted iterations
voters   [  20% ] 34/50 VUs  0m20.0s/1m40.0s

running (0m21.0s), 36/50 VUs, 381 complete and 0 interrupted iterations
voters   [  21% ] 36/50 VUs  0m21.0s/1m40.0s

running (0m22.0s), 37/50 VUs, 405 complete and 0 interrupted iterations
voters   [  22% ] 37/50 VUs  0m22.0s/1m40.0s

running (0m23.0s), 39/50 VUs, 433 complete and 0 interrupted iterations
voters   [  23% ] 39/50 VUs  0m23.0s/1m40.0s

running (0m24.0s), 40/50 VUs, 455 complete and 0 interrupted iterations
voters   [  24% ] 40/50 VUs  0m24.0s/1m40.0s

running (0m25.0s), 42/50 VUs, 476 complete and 0 interrupted iterations
voters   [  25% ] 42/50 VUs  0m25.0s/1m40.0s

running (0m26.0s), 43/50 VUs, 501 complete and 0 interrupted iterations
voters   [  26% ] 43/50 VUs  0m26.0s/1m40.0s

running (0m27.0s), 45/50 VUs, 531 complete and 0 interrupted iterations
voters   [  27% ] 45/50 VUs  0m27.0s/1m40.0s

running (0m28.0s), 46/50 VUs, 553 complete and 0 interrupted iterations
voters   [  28% ] 46/50 VUs  0m28.0s/1m40.0s

running (0m29.0s), 48/50 VUs, 581 complete and 0 interrupted iterations
voters   [  29% ] 48/50 VUs  0m29.0s/1m40.0s

running (0m30.0s), 49/50 VUs, 599 complete and 0 interrupted iterations
voters   [  30% ] 49/50 VUs  0m30.0s/1m40.0s

running (0m31.0s), 50/50 VUs, 629 complete and 0 interrupted iterations
voters   [  31% ] 50/50 VUs  0m31.0s/1m40.0s

running (0m32.0s), 50/50 VUs, 648 complete and 0 interrupted iterations
voters   [  32% ] 50/50 VUs  0m32.0s/1m40.0s

running (0m33.0s), 50/50 VUs, 676 complete and 0 interrupted iterations
voters   [  33% ] 50/50 VUs  0m33.0s/1m40.0s

running (0m34.0s), 50/50 VUs, 694 complete and 0 interrupted iterations
voters   [  34% ] 50/50 VUs  0m34.0s/1m40.0s

running (0m35.0s), 50/50 VUs, 718 complete and 0 interrupted iterations
voters   [  35% ] 50/50 VUs  0m35.0s/1m40.0s

running (0m36.0s), 50/50 VUs, 739 complete and 0 interrupted iterations
voters   [  36% ] 50/50 VUs  0m36.0s/1m40.0s

running (0m37.0s), 50/50 VUs, 767 complete and 0 interrupted iterations
voters   [  37% ] 50/50 VUs  0m37.0s/1m40.0s

running (0m38.0s), 50/50 VUs, 788 complete and 0 interrupted iterations
voters   [  38% ] 50/50 VUs  0m38.0s/1m40.0s

running (0m39.0s), 50/50 VUs, 815 complete and 0 interrupted iterations
voters   [  39% ] 50/50 VUs  0m39.0s/1m40.0s

running (0m40.0s), 50/50 VUs, 837 complete and 0 interrupted iterations
voters   [  40% ] 50/50 VUs  0m40.0s/1m40.0s

running (0m41.0s), 50/50 VUs, 860 complete and 0 interrupted iterations
voters   [  41% ] 50/50 VUs  0m41.0s/1m40.0s

running (0m42.0s), 50/50 VUs, 885 complete and 0 interrupted iterations
voters   [  42% ] 50/50 VUs  0m42.0s/1m40.0s
time="2026-05-24T00:10:15+01:00" level=warning msg="The test has generated metrics with 100117 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m43.0s), 50/50 VUs, 909 complete and 0 interrupted iterations
voters   [  43% ] 50/50 VUs  0m43.0s/1m40.0s

running (0m44.0s), 50/50 VUs, 931 complete and 0 interrupted iterations
voters   [  44% ] 50/50 VUs  0m44.0s/1m40.0s

running (0m45.0s), 50/50 VUs, 952 complete and 0 interrupted iterations
voters   [  45% ] 50/50 VUs  0m45.0s/1m40.0s

running (0m46.0s), 50/50 VUs, 969 complete and 0 interrupted iterations
voters   [  46% ] 50/50 VUs  0m46.0s/1m40.0s

running (0m47.0s), 50/50 VUs, 988 complete and 0 interrupted iterations
voters   [  47% ] 50/50 VUs  0m47.0s/1m40.0s

running (0m48.0s), 50/50 VUs, 1017 complete and 0 interrupted iterations
voters   [  48% ] 50/50 VUs  0m48.0s/1m40.0s

running (0m49.0s), 50/50 VUs, 1036 complete and 0 interrupted iterations
voters   [  49% ] 50/50 VUs  0m49.0s/1m40.0s

running (0m50.0s), 50/50 VUs, 1052 complete and 0 interrupted iterations
voters   [  50% ] 50/50 VUs  0m50.0s/1m40.0s

running (0m51.0s), 50/50 VUs, 1073 complete and 0 interrupted iterations
voters   [  51% ] 50/50 VUs  0m51.0s/1m40.0s

running (0m52.0s), 50/50 VUs, 1088 complete and 0 interrupted iterations
voters   [  52% ] 50/50 VUs  0m52.0s/1m40.0s

running (0m53.0s), 50/50 VUs, 1117 complete and 0 interrupted iterations
voters   [  53% ] 50/50 VUs  0m53.0s/1m40.0s

running (0m54.0s), 50/50 VUs, 1138 complete and 0 interrupted iterations
voters   [  54% ] 50/50 VUs  0m54.0s/1m40.0s

running (0m55.0s), 50/50 VUs, 1166 complete and 0 interrupted iterations
voters   [  55% ] 50/50 VUs  0m55.0s/1m40.0s

running (0m56.0s), 50/50 VUs, 1187 complete and 0 interrupted iterations
voters   [  56% ] 50/50 VUs  0m56.0s/1m40.0s

running (0m57.0s), 50/50 VUs, 1204 complete and 0 interrupted iterations
voters   [  57% ] 50/50 VUs  0m57.0s/1m40.0s

running (0m58.0s), 50/50 VUs, 1231 complete and 0 interrupted iterations
voters   [  58% ] 50/50 VUs  0m58.0s/1m40.0s

running (0m59.0s), 50/50 VUs, 1254 complete and 0 interrupted iterations
voters   [  59% ] 50/50 VUs  0m59.0s/1m40.0s

running (1m00.0s), 50/50 VUs, 1281 complete and 0 interrupted iterations
voters   [  60% ] 50/50 VUs  1m00.0s/1m40.0s

running (1m01.0s), 50/50 VUs, 1296 complete and 0 interrupted iterations
voters   [  61% ] 50/50 VUs  1m01.0s/1m40.0s

running (1m02.0s), 50/50 VUs, 1310 complete and 0 interrupted iterations
voters   [  62% ] 50/50 VUs  1m02.0s/1m40.0s

running (1m03.0s), 50/50 VUs, 1318 complete and 0 interrupted iterations
voters   [  63% ] 50/50 VUs  1m03.0s/1m40.0s

running (1m04.0s), 50/50 VUs, 1331 complete and 0 interrupted iterations
voters   [  64% ] 50/50 VUs  1m04.0s/1m40.0s

running (1m05.0s), 50/50 VUs, 1331 complete and 0 interrupted iterations
voters   [  65% ] 50/50 VUs  1m05.0s/1m40.0s

running (1m06.0s), 50/50 VUs, 1331 complete and 0 interrupted iterations
voters   [  66% ] 50/50 VUs  1m06.0s/1m40.0s

running (1m07.0s), 50/50 VUs, 1331 complete and 0 interrupted iterations
voters   [  67% ] 50/50 VUs  1m07.0s/1m40.0s

running (1m08.0s), 50/50 VUs, 1331 complete and 0 interrupted iterations
voters   [  68% ] 50/50 VUs  1m08.0s/1m40.0s

running (1m09.0s), 50/50 VUs, 1334 complete and 0 interrupted iterations
voters   [  69% ] 50/50 VUs  1m09.0s/1m40.0s

running (1m10.0s), 50/50 VUs, 1338 complete and 0 interrupted iterations
voters   [  70% ] 50/50 VUs  1m10.0s/1m40.0s

running (1m11.0s), 50/50 VUs, 1347 complete and 0 interrupted iterations
voters   [  71% ] 50/50 VUs  1m11.0s/1m40.0s

running (1m12.0s), 50/50 VUs, 1353 complete and 0 interrupted iterations
voters   [  72% ] 50/50 VUs  1m12.0s/1m40.0s

running (1m13.0s), 50/50 VUs, 1367 complete and 0 interrupted iterations
voters   [  73% ] 50/50 VUs  1m13.0s/1m40.0s

running (1m14.0s), 50/50 VUs, 1372 complete and 0 interrupted iterations
voters   [  74% ] 50/50 VUs  1m14.0s/1m40.0s

running (1m15.0s), 50/50 VUs, 1381 complete and 0 interrupted iterations
voters   [  75% ] 50/50 VUs  1m15.0s/1m40.0s

running (1m16.0s), 50/50 VUs, 1384 complete and 0 interrupted iterations
voters   [  76% ] 50/50 VUs  1m16.0s/1m40.0s

running (1m17.0s), 50/50 VUs, 1388 complete and 0 interrupted iterations
voters   [  77% ] 50/50 VUs  1m17.0s/1m40.0s

running (1m18.0s), 50/50 VUs, 1391 complete and 0 interrupted iterations
voters   [  78% ] 50/50 VUs  1m18.0s/1m40.0s

running (1m19.0s), 50/50 VUs, 1402 complete and 0 interrupted iterations
voters   [  79% ] 50/50 VUs  1m19.0s/1m40.0s

running (1m20.0s), 50/50 VUs, 1411 complete and 0 interrupted iterations
voters   [  80% ] 50/50 VUs  1m20.0s/1m40.0s

running (1m21.0s), 50/50 VUs, 1419 complete and 0 interrupted iterations
voters   [  81% ] 50/50 VUs  1m21.0s/1m40.0s

running (1m22.0s), 50/50 VUs, 1431 complete and 0 interrupted iterations
voters   [  82% ] 50/50 VUs  1m22.0s/1m40.0s

running (1m23.0s), 50/50 VUs, 1437 complete and 0 interrupted iterations
voters   [  83% ] 50/50 VUs  1m23.0s/1m40.0s

running (1m24.0s), 50/50 VUs, 1452 complete and 0 interrupted iterations
voters   [  84% ] 50/50 VUs  1m24.0s/1m40.0s

running (1m25.0s), 50/50 VUs, 1467 complete and 0 interrupted iterations
voters   [  85% ] 50/50 VUs  1m25.0s/1m40.0s

running (1m26.0s), 50/50 VUs, 1481 complete and 0 interrupted iterations
voters   [  86% ] 50/50 VUs  1m26.0s/1m40.0s

running (1m27.0s), 50/50 VUs, 1487 complete and 0 interrupted iterations
voters   [  87% ] 50/50 VUs  1m27.0s/1m40.0s

running (1m28.0s), 50/50 VUs, 1502 complete and 0 interrupted iterations
voters   [  88% ] 50/50 VUs  1m28.0s/1m40.0s

running (1m29.0s), 50/50 VUs, 1517 complete and 0 interrupted iterations
voters   [  89% ] 50/50 VUs  1m29.0s/1m40.0s

running (1m30.0s), 50/50 VUs, 1531 complete and 0 interrupted iterations
voters   [  90% ] 50/50 VUs  1m30.0s/1m40.0s

running (1m31.0s), 50/50 VUs, 1538 complete and 0 interrupted iterations
voters   [  91% ] 50/50 VUs  1m31.0s/1m40.0s

running (1m32.0s), 48/50 VUs, 1556 complete and 0 interrupted iterations
voters   [  92% ] 48/50 VUs  1m32.0s/1m40.0s

running (1m33.0s), 43/50 VUs, 1577 complete and 0 interrupted iterations
voters   [  93% ] 43/50 VUs  1m33.0s/1m40.0s

running (1m34.0s), 40/50 VUs, 1587 complete and 0 interrupted iterations
voters   [  94% ] 40/50 VUs  1m34.0s/1m40.0s

running (1m35.0s), 33/50 VUs, 1600 complete and 0 interrupted iterations
voters   [  95% ] 33/50 VUs  1m35.0s/1m40.0s

running (1m36.0s), 25/50 VUs, 1624 complete and 0 interrupted iterations
voters   [  96% ] 25/50 VUs  1m36.0s/1m40.0s

running (1m37.0s), 21/50 VUs, 1633 complete and 0 interrupted iterations
voters   [  97% ] 21/50 VUs  1m37.0s/1m40.0s

running (1m38.0s), 13/50 VUs, 1651 complete and 0 interrupted iterations
voters   [  98% ] 13/50 VUs  1m38.0s/1m40.0s

running (1m39.0s), 06/50 VUs, 1664 complete and 0 interrupted iterations
voters   [  99% ] 06/50 VUs  1m39.0s/1m40.0s

running (1m40.0s), 03/50 VUs, 1670 complete and 0 interrupted iterations
voters   [ 100% ] 03/50 VUs  1m40.0s/1m40.0s


  █ THRESHOLDS 

    checks{tag:vote}
    ✓ 'rate>0.98' rate=100.00%

    http_req_duration
    ✓ 'p(95)<600' p(95)=158.51ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 51863   516.654983/s
    checks_succeeded...: 100.00% 51863 out of 51863
    checks_failed......: 0.00%   0 out of 51863

    ✓ add 201
    ✓ vote 200
    ✓ flip 200
    ✓ list 200

    HTTP
    http_req_duration..............: avg=57.54ms min=1.77ms   med=42.34ms max=2.11s p(90)=110.09ms p(95)=158.51ms
      { expected_response:true }...: avg=57.54ms min=1.77ms   med=42.34ms max=2.11s p(90)=110.09ms p(95)=158.51ms
    http_req_failed................: 0.00% 0 out of 56882
    http_reqs......................: 56882 566.653852/s

    EXECUTION
    iteration_duration.............: avg=2.46s   min=670.94ms med=2.07s   max=10.7s p(90)=4.04s    p(95)=7.16s   
    iterations.....................: 1673  16.66629/s
    vus............................: 3     min=3          max=50
    vus_max........................: 50    min=50         max=50

    NETWORK
    data_received..................: 96 MB 953 kB/s
    data_sent......................: 28 MB 281 kB/s



running (1m40.4s), 00/50 VUs, 1673 complete and 0 interrupted iterations
voters ✓ [ 100% ] 00/50 VUs  1m40s